app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Yeet"], ["description", "A good yeeting"], ["created_at", "2018-10-12 05:01:05.268931"], ["updated_at", "2018-10-12 05:01:05.268931"], ["user_id", 2]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Howdy"], ["description", "Whoppidy doo"], ["updated_at", "2018-08-06 02:41:53.172810"], ["id", 1]]